Repository: mirza-ito/DotNetPlayground
Catalog: Cleaners.Web/Localization/Resources/*.po
Languages: bs

# welcome.message
source: Welcome to {0} panel.
bs: Dobrodošli na {0} panel.

source: Required field
bs: Obavezno polje

source: Users
bs: Korisnici

source: Username
bs: Korisničko ime

source: First name
bs: Ime

source: Last name
bs: Prezime

source: Phone number
bs: Telefon

# password.confirmed
source: Confirmed password
bs: Potvrda lozinke

source: Active
bs: Aktivan

source: Lockout enabled
bs: Zaključavanje omogućeno

# lockout.enabled.info
source: Lock users account after {0} invalid attempts for {1}.
bs: Zaključaj korisniči račun nakon {0} neuspješnih pokušaja na zadano vrijeme ({1}).

# lockout.disabled.note
source: User lockout is currently disabled for all users.
bs: Zaključavanje korisničkog računa je trenutno onemogućeno za sve korisnike.

# account.active.info
source: Mark user account as active
bs: Označi račun kao aktivan

source: Create new user
bs: Kreiraj novog korisnika

source: Update user
bs: Ažuriraj korisnika

source: Password
bs: Lozinka

source: Roles
bs: Uloge

source: Select roles
bs: Odaberite uloge

# empty.select.list.warning
source: Selection for this drop-down is required. Since this list is currently empty, you won't be able to finish create process.
bs: Korisnička ploča

# concurrency.failure
source: Optimistic concurrency failure, object has been modified.
bs: Došlo je do greške prilikom sačuvanja, zapis je već ažuriran.

# default.error
source: An unknown failure has occurred.
bs: Došlo je do nepoznate greške.

# duplicate.email
source: Email '{0}' is already taken.
bs: Email '{0}' je zauzet.

# duplicate.role.name
source: Role name '{0}' is invalid.
bs: Uloga '{0}' već postoji.

# duplicate.user.name
source: Username '{0}' is already taken.
bs: Korisničko ime '{0}' je zauzeto.

# invalid.email
source: Email '{0}' is invalid.
bs: Email '{0}' nije validan.

# invalid.role.name
source: Role name '{0}' is invalid.
bs: Uloga '{0}' nije validna.

source: Invalid token.
bs: Token nije validan.

# invalid.user.name
source: User name '{0}' is invalid, can only contain letters or digits.
bs: Korisničko ime '{0}' nije validno, može sadržavati samo slova i brojeve.

# login.already.associated
source: A user with this login already exists.
bs: Korisnik s unesenim login podacima već postoji.

# password.mismatch
source: Incorrect password.
bs: Lozinke se ne poklapaju.

# password.requires.digit
source: Passwords must have at least 1 digit ('0'-'9').
bs: Lozinka mora sadržavati minimalno 1 broj ('0'-'9').

# password.requires.lower
source: Passwords must have at least 1 lowercase ('a'-'z').
bs: Lozinka mora sadržavati minimalno 1 malo slovo ('a'-'z').

# password.requires.non.alphanumeric
source: Passwords must have at least 1 non alphanumeric character.
bs: Lozinka mora sadržavati minimalno 1 specijalni karakter.

# password.requires.unique.chars
source: Passwords must have at least {0} unique character.
bs: Lozinka mora sadržavati minimalno {0} jedinstveni karakter.

# password.requires.upper
source: Passwords must have at least {0} uppercase ('A'-'Z').
bs: Lozinka mora sadržavati minimalno 1 veliko slovo.

# password.too.short
source: Passwords must be at least {0} characters.
bs: Lozinka mora sadržavati minimalno {0} karaktera.

# user.already.has.password
source: User already has a password set.
bs: Korisnik već ima postavljenu lozinku.

# user.already.in.role
source: User already in role '{0}'.
bs: Korisnik se već nalazi u ulozi '{0}'.

# user.lockout.not.enabled
source: Lockout is not enabled for this user.
bs: Zaključavanje računa nije omogućeno za ovog korisnika.

# user.not.in.role
source: User is not in role '{0}'.
bs: Korisnik se ne nalazi u ulozi '{0}'.

# email.not.confirmed
source: Email requires verification.
bs: Email zahtijeva potvrdu.

# invalid.login.data
source: Incorrect username or password.
bs: Pogrešno korisničko ime ili lozinka.

# account.locked.out
source: Account is currently locked out.
bs: Korisnički račun je trenutno zaključan.

# account.not.allowed
source: Account is currently not allowed to access.
bs: Korisnički račun nema pravo pristupa.

# account.requires.two.factor
source: Account requires two factor verification.
bs: Korisnički račun zahtijeva two factor potvrdu.

source: Remember me
bs: Zapamti me

source: Cancel
bs: Odustani

source: Save
bs: Sačuvaj

source: Details
bs: Detalji

source: Invalid current password.
bs: Pogrešna trenutna lozinka.

source: Current password
bs: Trenutna lozinka

source: New password
bs: Nova lozinka

source: Change password
bs: Promjena lozinke

source: Profile
bs: Profil

source: Email confirmed
bs: Email potvrđen

source: Access failed count
bs: Broj neuspješnih pokušaja

source: Lockout end
bs: Završetak zaključavanja

source: Creation date
bs: Datum kreiranja

source: Last update date
bs: Posljednje ažuriranje

source: Settings
bs: Postavke

source: User accounts
bs: Korisnički računi

source: Max failed access attempts
bs: Maksimalan broj neuspješnih pokušaja

source: Default lockout time span
bs: Vrijeme trajanja zaključavanja

source: Allowed for new users
bs: Dozvoljeno za nove korisnike

source: Require digit
bs: Zahtijeva broj

source: Require lowercase
bs: Zahtijeva malo slovo

source: Require uppercase
bs: Zahtijeva veliko slovo

source: Require non alphanumeric
bs: Zahtijeva specijalni karakter

source: Required length
bs: Zahtijevana dužina

source: Required unique chars
bs: Zahtijevani jedinstveni karakteri

source: Require confirmed email
bs: Zahtijeva potvrđen email

source: Require confirmed phone number
bs: Zahtijeva potvrđen telefon

source: Require unique email
bs: Zahtijeva jedinstven email

source: Allowed username characters
bs: Dozvoljeni karakteri za korisničko ime

source: Lockout settings
bs: Postavke zaključavanja

source: Password settings
bs: Postavke lozinke

source: Sign in settings
bs: Postavke prijave

source: User settings
bs: Postavke korisnika

source: Authentication settings
bs: Postavke autentifikacije

# select.language
source: Select your language
bs: Odaberite jezik

source: English
bs: Engleski

source: Bosnian
bs: Bosanski

source: Name
bs: Naziv

source: Create record
bs: Kreiranje zapisa

source: Update record
bs: Ažuriranje zapisa

source: Delete record
bs: Brisanje zapisa

source: Restore record
bs: Vraćanje zapisa

source: Add
bs: Dodaj

source: Version
bs: Verzija

# copyright
source: <strong>Copyright © {0} <a href="{1}">{2}</a>.</strong> All rights reserved.
bs: <strong>Copyright © {0} <a href="{1}" target="_blank">{2}</a>.</strong> Sva prava pridržana.

# not.found.text
source: The page you requested was not found.
bs: Traženi sadržaj nije pronađen. Vratite se na početnu stranicu i pokušajte ponovno.

# forbidden.text
source: You are not allowed to view this page.
bs: Nemate pristup ovoj stranici.

# error.title
source: Error
bs: Greška

# error.text
source: Error occurred while processing your request
bs: Došlo je do greške prilikom obrade vašeg zahtjeva.

# create.record.successful
source: Record has been created successfully.
bs: Uspješno ste kreirali novi zapis.

# update.record.successful
source: Record has been updated successfully.
bs: Uspješno ste ažurirali odabrani zapis.

# delete.record.successful
source: Record has been deleted successfully.
bs: Uspješno ste izbrisali odabrani zapis.

# restore.record.successful
source: Record has been restored successfully.
bs: Uspješno ste vratili odabrani zapis.

source: Email confirmation
bs: Potvrda emaila

# confirmation.message
source: Do you wish to proceed with this operation?
bs: Da li sigurno želite izvršiti ovu operaciju?

source: Submit
bs: Potvrdi

# confirm.email.successful
source: Email has been confirmed successfully.
bs: Uspješno ste potvrdili email odabranog korisnika.

# change.password.successful
source: Password has been changed successfully.
bs: Uspješno ste promijenili lozinku.

source: Back
bs: Nazad
